## Installation

Uncomment the following cell to install the required packages.

In [1]:
# %pip install duckdb duckdb-engine jupysql

## Library Import and Configuration

In [2]:
import duckdb
import pandas as pd

# Import jupysql Jupyter extension to create SQL cells
%load_ext sql

Set configurations on jupysql to directly output data to Pandas and to simplify the output that is printed to the notebook.

In [3]:
%config SqlMagic.autopandas = True
%config SqlMagic.feedback = False
%config SqlMagic.displaycon = False

## Connecting to DuckDB

Connect jupysql to DuckDB using a SQLAlchemy-style connection string. You may either connect to an in memory DuckDB, or a file backed db.

In [4]:
%sql duckdb:///:memory:
# %sql duckdb:///path/to/file.db

 If your SQL query is one line only, you may use the `%sql` magic command. For multi-line SQL query, you may use the `%%sql` magic command.

## Install extensions


Check available DuckDB extensions.

In [5]:
%%sql

SELECT * FROM duckdb_extensions();

,extension_name,loaded,installed,install_path,description,aliases
0,arrow,False,False,,A zero-copy data integration between Apache Ar...,[]
1,autocomplete,False,False,,Adds support for autocomplete in the shell,[]
2,aws,False,False,,Provides features that depend on the AWS SDK,[]
3,azure,False,False,,Adds a filesystem abstraction for Azure blob s...,[]
4,excel,False,False,,Adds support for Excel-like format strings,[]
5,fts,False,True,(BUILT-IN),Adds support for Full-Text Search Indexes,[]
6,httpfs,False,True,/Users/ollieballinger/.duckdb/extensions/v0.9....,Adds support for reading and writing files ove...,"[http, https, s3]"
7,iceberg,False,False,,Adds support for Apache Iceberg,[]
8,icu,True,True,(BUILT-IN),Adds support for time zones and collations usi...,[]
9,inet,False,False,,Adds support for IP-related data types and fun...,[]
10,jemalloc,False,False,,Overwrites system allocator with JEMalloc,[]
11,json,True,True,(BUILT-IN),Adds support for JSON operations,[]
12,motherduck,False,False,,Enables motherduck integration with the system,[md]
13,mysql_scanner,False,False,,Adds support for connecting to a MySQL database,[mysql]
14,parquet,True,True,(BUILT-IN),Adds support for reading and writing parquet f...,[]
15,postgres_scanner,False,False,,Adds support for connecting to a Postgres data...,[postgres]
16,spatial,False,True,/Users/ollieballinger/.duckdb/extensions/v0.9....,Geospatial extension that adds support for wor...,[]
17,sqlite_scanner,False,False,,Adds support for reading and writing SQLite da...,"[sqlite, sqlite3]"
18,substrait,False,False,,Adds support for the Substrait integration,[]
19,tpcds,True,True,(BUILT-IN),Adds TPC-DS data generation and query support,[]
20,tpch,True,True,(BUILT-IN),Adds TPC-H data generation and query support,[]
21,visualizer,False,False,,Creates an HTML-based visualization of the que...,[]

DuckDB's [httpfs extension](https://duckdb.org/docs/extensions/httpfs) allows parquet and csv files to be queried remotely over http. This is useful for querying large datasets without having to download them locally. Let's install the extension and load the extension.

In [6]:
%%sql

INSTALL httpfs;
LOAD httpfs;
INSTALL spatial;
LOAD spatial;

Empty DataFrame
Columns: [Success]
Index: []

## Read CSV

Use the `httpfs` extension to read the `cities.csv` file from the web.

## Create Table

Create a table named `cities` from the `cities.csv` file.

In [7]:
%%sql 

CREATE TABLE ais AS SELECT * FROM 'casa0025_ships.csv';

Empty DataFrame
Columns: [Success]
Index: []

Create a table named `countries` from the `countries.csv` file.

In [8]:
%%sql 

SELECT * FROM ais LIMIT 10;

,vesselid,vessel_name,vsl_descr,dwt,v_length,vesselid_1,draught,sog,date,geometry,lat,lon,geom
0,350053,30 Let Pobedy,general cargo,5150.0,NaN,350053,3.5,5.2,2022-07-25 02:53:29,POINT (4064644.931701794 5645447.347887114),45.151777,36.513327,POINT (36.5133266666667 45.1517766666667)
1,350053,30 Let Pobedy,general cargo,5150.0,NaN,350053,3.5,0.7,2022-07-25 03:09:37,POINT (4065474.63297317 5644612.369513403),45.146487,36.520780,POINT (36.52078 45.1464866666667)
2,350053,30 Let Pobedy,general cargo,5150.0,NaN,350053,3.5,0.7,2022-07-25 03:13:58,POINT (4065606.54656976 5644570.017602938),45.146218,36.521965,POINT (36.521965 45.1462183333333)
3,350053,30 Let Pobedy,general cargo,5150.0,NaN,350053,3.5,0.1,2022-07-25 04:16:06,POINT (4065612.669141753 5644386.933376937),45.145058,36.522020,POINT (36.52202 45.1450583333333)
4,350053,30 Let Pobedy,general cargo,5150.0,NaN,350053,3.5,0.0,2022-07-25 05:20:17,POINT (4065593.55929583 5644367.204695632),45.144933,36.521848,POINT (36.5218483333333 45.1449333333333)
5,350053,30 Let Pobedy,general cargo,5150.0,NaN,350053,3.5,0.0,2022-07-25 06:23:57,POINT (4065587.622256325 5644385.618130174),45.145050,36.521795,POINT (36.521795 45.14505)
6,350053,30 Let Pobedy,general cargo,5150.0,NaN,350053,3.5,0.0,2022-07-25 07:25:25,POINT (4065384.093120661 5644627.626772217),45.146583,36.519967,POINT (36.5199666666667 45.1465833333333)
7,350053,30 Let Pobedy,general cargo,5150.0,NaN,350053,3.5,0.2,2022-07-25 10:36:41,POINT (4065487.434714611 5644663.92862999),45.146813,36.520895,POINT (36.520895 45.1468133333333)
8,350053,30 Let Pobedy,general cargo,5150.0,NaN,350053,3.5,0.0,2022-07-25 12:15:05,POINT (4065632.150052642 5644532.400855862),45.145980,36.522195,POINT (36.522195 45.14598)
9,350053,30 Let Pobedy,general cargo,5150.0,NaN,350053,3.5,0.1,2022-07-25 13:41:53,POINT (4065623.986623321 5644419.025457622),45.145262,36.522122,POINT (36.5221216666667 45.1452616666667)

In [36]:
%%sql 

alter table ais add column geo geometry;
update ais set geo = ST_GeomFromText(geometry);

Empty DataFrame
Columns: [Success]
Index: []

In [37]:
%%sql 

select * from ais limit 10;

,vesselid,vessel_name,vsl_descr,dwt,v_length,vesselid_1,draught,sog,date,geometry,lat,lon,geom,geo
0,350053,30 Let Pobedy,general cargo,5150.0,NaN,350053,3.5,5.2,2022-07-25 02:53:29,POINT (4064644.931701794 5645447.347887114),45.151777,36.513327,POINT (36.5133266666667 45.1517766666667),"[0, 0, 24, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0,..."
1,350053,30 Let Pobedy,general cargo,5150.0,NaN,350053,3.5,0.7,2022-07-25 03:09:37,POINT (4065474.63297317 5644612.369513403),45.146487,36.520780,POINT (36.52078 45.1464866666667),"[0, 0, 24, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0,..."
2,350053,30 Let Pobedy,general cargo,5150.0,NaN,350053,3.5,0.7,2022-07-25 03:13:58,POINT (4065606.54656976 5644570.017602938),45.146218,36.521965,POINT (36.521965 45.1462183333333),"[0, 0, 24, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0,..."
3,350053,30 Let Pobedy,general cargo,5150.0,NaN,350053,3.5,0.1,2022-07-25 04:16:06,POINT (4065612.669141753 5644386.933376937),45.145058,36.522020,POINT (36.52202 45.1450583333333),"[0, 0, 24, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0,..."
4,350053,30 Let Pobedy,general cargo,5150.0,NaN,350053,3.5,0.0,2022-07-25 05:20:17,POINT (4065593.55929583 5644367.204695632),45.144933,36.521848,POINT (36.5218483333333 45.1449333333333),"[0, 0, 24, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0,..."
5,350053,30 Let Pobedy,general cargo,5150.0,NaN,350053,3.5,0.0,2022-07-25 06:23:57,POINT (4065587.622256325 5644385.618130174),45.145050,36.521795,POINT (36.521795 45.14505),"[0, 0, 24, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0,..."
6,350053,30 Let Pobedy,general cargo,5150.0,NaN,350053,3.5,0.0,2022-07-25 07:25:25,POINT (4065384.093120661 5644627.626772217),45.146583,36.519967,POINT (36.5199666666667 45.1465833333333),"[0, 0, 24, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0,..."
7,350053,30 Let Pobedy,general cargo,5150.0,NaN,350053,3.5,0.2,2022-07-25 10:36:41,POINT (4065487.434714611 5644663.92862999),45.146813,36.520895,POINT (36.520895 45.1468133333333),"[0, 0, 24, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0,..."
8,350053,30 Let Pobedy,general cargo,5150.0,NaN,350053,3.5,0.0,2022-07-25 12:15:05,POINT (4065632.150052642 5644532.400855862),45.145980,36.522195,POINT (36.522195 45.14598),"[0, 0, 24, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0,..."
9,350053,30 Let Pobedy,general cargo,5150.0,NaN,350053,3.5,0.1,2022-07-25 13:41:53,POINT (4065623.986623321 5644419.025457622),45.145262,36.522122,POINT (36.5221216666667 45.1452616666667),"[0, 0, 24, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0,..."

In [1]:
%%sql 

SELECT
    a1.vesselid AS ship1,
    a2.vesselid AS ship2,
    a1.date AS start,
    a2.date AS end
FROM
    ais a1
JOIN
    AND ST_Distance(a1.geom, a2.geom) <= 500
    AND a1.vesselid <> a2.vesselid
    AND ABS(EXTRACT(EPOCH FROM (a2.date - a1.date))) > 7200;

UsageError: Cell magic `%%sql` not found.

Display the table content in the database.

In [ ]:
%%sql 

FROM cities;

In [ ]:
%%sql 

FROM countries;

## The SQL SELECT statement

The `SELECT` statement is used to select data from a database. Use either `SELECT *` to select all columns, or `SELECT column1, column2, ...` to select specific columns.

`SELECT * FROM cities` is the same as `FROM cities`.

In [ ]:
%%sql 

SELECT * FROM cities;

To limit the number of rows returned, use the `LIMIT` keyword. For example, `SELECT * FROM cities LIMIT 10` will return only the first 10 rows.

In [ ]:
%%sql

SELECT * FROM cities LIMIT 10;

Select a subset of columns from the `cities` table and display the first 10 rows.

In [ ]:
%%sql

SELECT name, country FROM cities LIMIT 10;

To select distinct values, use the `DISTINCT` keyword. For example, `SELECT DISTINCT country FROM cities` will return only the distinct values of the `country` column.

In [ ]:
%%sql

SELECT DISTINCT country FROM cities LIMIT 10;

To count the number of rows returned, use the `COUNT(*)` function. For example, `SELECT COUNT(*) FROM cities` will return the number of rows in the `cities` table.

In [ ]:
%%sql

SELECT COUNT(*) FROM cities;

To count the number of distinct values, use the `COUNT(DISTINCT column)` function. For example, `SELECT COUNT(DISTINCT country) FROM cities` will return the number of distinct values in the `country` column.

In [ ]:
%%sql

SELECT COUNT(DISTINCT country) FROM cities;

To calculate the maximum value, use the `MAX(column)` function. For example, `SELECT MAX(population) FROM cities` will return the maximum value in the `population` column.

In [ ]:
%%sql

SELECT MAX(population) FROM cities;

To calculate the total value, use the `SUM(column)` function. For example, `SELECT SUM(population) FROM cities` will return the total value in the `population` column.

In [ ]:
%%sql

SELECT SUM(population) FROM cities;

To calculate the average value, use the `AVG(column)` function. For example, `SELECT AVG(population) FROM cities` will return the average value in the `population` column.

In [ ]:
%%sql

SELECT AVG(population) FROM cities;

To order the results, use the `ORDER BY column` clause. For example, `SELECT * FROM cities ORDER BY country` will return the rows ordered by the `country` column alphabetically.

In [ ]:
%%sql

SELECT * FROM cities ORDER BY country LIMIT 10;

To order the results in descending order, use the `ORDER BY column DESC` clause. For example, `SELECT * FROM cities ORDER BY country ASC, population DESC` will return the rows ordered by the `country` column alphabetical order and then by the `population` column in descending order.

In [ ]:
%%sql 

SELECT * FROM cities ORDER BY country ASC, population DESC LIMIT 10;

## The WHERE Clause

The `WHERE` clause is used to filter records. The `WHERE` clause is used to extract only those records that fulfill a specified condition.

In [ ]:
%%sql

SELECT * FROM cities WHERE country='USA'

You can use boolean operators such as `AND`, `OR`, `NOT` to filter records. For example, `SELECT * FROM cities WHERE country='USA' OR country='CAN'` will return the rows where the `country` column is either `USA` or `CAN`.

In [ ]:
%%sql

SELECT * FROM cities WHERE country='USA' OR country='CAN';

To select US cities with a population greater than 1 million, use the following query: `SELECT * FROM cities WHERE country='USA' AND population > 1000000`.

In [ ]:
%%sql 

SELECT * FROM cities WHERE country='USA' AND population>1000000;

To select cities with the country name starting with the letter `U`, use the following query: `SELECT * FROM cities WHERE country LIKE 'U%'`.

In [ ]:
%%sql

SELECT * FROM cities WHERE country LIKE 'U%';

To select cities with the country name ending with the letter `A`, use the following query: `SELECT * FROM cities WHERE country LIKE '%A'`.

In [ ]:
%%sql

SELECT * FROM cities WHERE country LIKE '%A';

To select cities with the country name containing the letter `S` in the middle, use the following query: `SELECT * FROM cities WHERE country LIKE '_S_'`.

In [ ]:
%%sql 

SELECT * FROM cities WHERE country LIKE '_S_';

To select cities from a list of countries, use the `IN` operator. For example, `SELECT * FROM cities WHERE country IN ('USA', 'CAN')` will return the rows where the `country` column is either `USA` or `CAN`.

In [ ]:
%%sql

SELECT * FROM cities WHERE country IN ('USA', 'CAN');

To select cities with a population between 1 and 10 million, use the following query: `SELECT * FROM cities WHERE population BETWEEN 1000000 AND 10000000`.

In [ ]:
%%sql 

SELECT * FROM cities WHERE population BETWEEN 1000000 AND 10000000;

## SQL Joins

Reference: https://www.w3schools.com/sql/sql_join.asp

Here are the different types of the JOINs in SQL:

- `(INNER) JOIN`: Returns records that have matching values in both tables
- `LEFT (OUTER) JOIN`: Returns all records from the left table, and the matched records from the right table
- `RIGHT (OUTER) JOIN`: Returns all records from the right table, and the matched records from the left table
- `FULL (OUTER) JOIN`: Returns all records when there is a match in either left or right table

![](https://i.imgur.com/mITYzuS.png)

We have two sample tables: `cities` and `countries`.

There are 1,249 cities in the `cities` table and 243 countries in the `countries` table.

In [ ]:
%%sql 

SELECT COUNT(*) FROM cities;

In [ ]:
%%sql 

SELECT * FROM cities LIMIT 10;

In [ ]:
%%sql 

SELECT COUNT(*) FROM countries;

In [ ]:
%%sql 

SELECT * FROM countries LIMIT 10;

### SQL Inner Join

The `INNER JOIN` keyword selects records that have matching values in both tables. In the example, we join the `cities` table with the `countries` table using the `country` column in the `cities` table and the `Alpha3_code` column in the `countries` table. The result contains 1,244 rows, indicating that there are 5 cities that do not have a matching country.

In [ ]:
%%sql

SELECT * FROM cities INNER JOIN countries ON cities.country = countries."Alpha3_code";

Only select the `city` and `country` columns from the `cities` table and the `Country` column from the `countries` table.

In [ ]:
%%sql

SELECT name, cities."country", countries."Country" FROM cities INNER JOIN countries ON cities.country = countries."Alpha3_code";

### SQL Left Join

The `LEFT JOIN` keyword returns all records from the left table (`cities`), and the matched records from the right table (`countries`). The result contains 1,249 rows, the same number of rows as the `cities` table.

In [ ]:
%%sql

SELECT * FROM cities LEFT JOIN countries ON cities.country = countries."Alpha3_code";

### SQL Right Join

The `RIGHT JOIN` keyword returns all records from the right table (`countries`), and the matched records from the left table (`cities`). The result contains 1,291 rows.

In [ ]:
%%sql

SELECT * FROM cities RIGHT JOIN countries ON cities.country = countries."Alpha3_code";

### SQL Full Join

The `FULL JOIN` keyword returns all records when there is a match in either left or right table. The result contains 1,296 rows.

In [ ]:
%%sql

SELECT * FROM cities FULL JOIN countries ON cities.country = countries."Alpha3_code";

### SQL Union

The `UNION` operator is used to combine the result-set of two or more `SELECT` statements.

In [ ]:
%%sql

SELECT country FROM cities
UNION 
SELECT "Alpha3_code" FROM countries;

## Aggregation

### Group By

The `GROUP BY` statement groups rows that have the same values into summary rows, like "find the number of cities in each country".

The `GROUP BY` statement is often used with aggregate functions (`COUNT`, `MAX`, `MIN`, `SUM`, `AVG`) to group the result-set by one or more columns.

In [ ]:
%%sql

SELECT COUNT(name), country 
FROM cities 
GROUP BY country 
ORDER BY COUNT(name) DESC;

In [ ]:
%%sql

SELECT countries."Country", COUNT(name)
FROM cities
LEFT JOIN countries ON cities.country = countries."Alpha3_code"
GROUP BY countries."Country"
ORDER BY COUNT(name) DESC;

### Having

The `HAVING` clause was added to SQL because the `WHERE` keyword could not be used with aggregate functions.

For example, to select countries with more than 40 cities:

In [ ]:
%%sql 

SELECT COUNT(name), country
FROM cities
GROUP BY country
HAVING COUNT(name) > 40
ORDER BY COUNT(name) DESC;

In [ ]:
%%sql

SELECT countries."Country", COUNT(name)
FROM cities
LEFT JOIN countries ON cities.country = countries."Alpha3_code"
GROUP BY countries."Country"
HAVING COUNT(name) > 40
ORDER BY COUNT(name) DESC;

## Conditional statements

The `CASE` statement goes through conditions and returns a value when the first condition is met (like an `IF-THEN-ELSE` statement). So, once a condition is true, it will stop reading and return the result. If no conditions are true, it returns the value in the `ELSE` clause.

For example, to divide cities into 3 groups based on their population:

In [ ]:
%%sql

SELECT name, population,
CASE
    WHEN population > 10000000 THEN 'Megacity'
    WHEN population > 1000000 THEN 'Large city'
    ELSE 'Small city'
END AS category
FROM cities;

## Saving results

You can save the results of a query to a new table using the `CREATE TABLE AS` statement.

In [ ]:
%%sql

CREATE TABLE cities2 AS SELECT * FROM cities;

Show the new table content.

In [ ]:
%%sql

FROM cities2;

Use the `DROP TABLE` statement to delete the table.

In [ ]:
%%sql

DROP TABLE IF EXISTS cities_usa;
CREATE TABLE cities_usa AS (SELECT * FROM cities WHERE country = 'USA');

In [ ]:
%%sql

FROM cities_usa;

Use the `INSERT INTO` statement to insert rows into a table.

In [ ]:
%%sql 

INSERT INTO cities_usa (SELECT * FROM cities WHERE country = 'CAN');

## SQL Comments

Comments are used to explain sections of SQL statements, or to prevent execution of SQL statements.


### Single line comMents

Single line comments start with --.

Any text between -- and the end of the line will be ignored (will not be executed).

The following example uses a single-line comment as an explanation:

In [ ]:
%%sql

SELECT * FROM cities LIMIT 10 -- This is a comment;

### Multi-line comments

Multi-line comments start with `/*` and end with `*/`.

Any text between `/*` and `*/` will be ignored.

The following example uses a multi-line comment as an explanation:

In [ ]:
%%sql

SELECT COUNT(name), country 
FROM cities 
/*
 * Adding Group by
 * Adding Order by
 */
GROUP BY country 
ORDER BY COUNT(name) DESC
LIMIT 10;